; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	infrared0 - mode
	spectrograph4 - mode
	infrared8 - mode
	infrared1 - mode
	spectrograph6 - mode
	infrared7 - mode
	spectrograph5 - mode
	spectrograph3 - mode
	image2 - mode
	Star2 - direction
	Star1 - direction
	GroundStation4 - direction
	Star3 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared7)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared7)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument3 infrared0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 spectrograph4)
	(supports instrument6 image2)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph6)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph3)
	(supports instrument7 infrared8)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument8 spectrograph5)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(pointing satellite3 Star9)
	(have_image Star5 spectrograph5)
	(have_image Star5 spectrograph3)
	(have_image Phenomenon6 infrared8)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon7 image2)
	(have_image Planet8 infrared8)
	(have_image Star9 infrared8)
))

)

; plan
1. (turn_to satellite3 star0 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 star0)
   goals met: 0 of 9
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 9
3. (calibrate satellite3 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 9
4. (turn_to satellite3 phenomenon6 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon6)
   goals met: 0 of 9
5. (turn_to satellite1 star2 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star2)
   goals met: 0 of 9
6. (turn_to satellite0 star1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star1)
   goals met: 0 of 9
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
9. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 0 of 9
10. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 9
11. (take_image satellite3 phenomenon6 instrument7 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 1 of 9
12. (take_image satellite3 phenomenon6 instrument7 infrared8)
   added: (have_image phenomenon6 infrared8)
   goals met: 2 of 9
13. (turn_to satellite0 star5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star5)
   goals met: 2 of 9
14. (take_image satellite0 star5 instrument0 spectrograph5)
   added: (have_image star5 spectrograph5)
   goals met: 3 of 9
15. (turn_to satellite1 phenomenon7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 9
16. (take_image satellite1 phenomenon7 instrument3 image2)
   added: (have_image phenomenon7 image2)
   goals met: 5 of 9
17. (turn_to satellite3 planet8 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet8)
   goals met: 5 of 9
18. (take_image satellite3 planet8 instrument7 infrared8)
   added: (have_image planet8 infrared8)
   goals met: 6 of 9
19. (turn_to satellite3 star5 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star5)
   goals met: 6 of 9
20. (take_image satellite3 star5 instrument7 spectrograph3)
   added: (have_image star5 spectrograph3)
   goals met: 7 of 9
21. (turn_to satellite3 star9 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star9)
   goals met: 8 of 9
22. (take_image satellite3 star9 instrument7 infrared8)
   added: (have_image star9 infrared8)
   goals met: 9 of 9
